dimitarm1/stm_flash_prj/STM32F0_Discovery_IO_Toggle/src/main.c
	/*
	 * commads:
	 * 0 - status 0-free, 1-Working, 2-COOLING, 3-WAITING
	 * 1 - start
	 * 2 - set pre-time
	 * 3 - set cool-time
	 * 4 - stop - may be not implemented in some controllers
	 * 5 - set main time
	 */

	digits[0] = 0;
	digits[1] = 1;
	digits[2] = 2;
	prev_status = 0;
	state = state_show_time;
	pre_time = 0;
	main_time = 0;
	cool_time = 0;
	dac_current_message = -1;
//	read_eeprom();
	if(!preset_pre_time || ! preset_cool_time){
		preset_pre_time = 7;
		preset_cool_time = 3;
		write_eeprom();// Paranoia check
	}
	GPIOA->BSRR = GPIO_BSRR_BS_0 | GPIO_BSRR_BS_1 | GPIO_BSRR_BS_2;
	GPIOC->BRR =  GPIO_BSRR_BS_3; // External sound
	GPIOC->BSRR =  GPIO_BSRR_BS_3; // Internal sound
	update_status();
	set_volume(0);

	play_message(0);

	while (1)
	{
		//		if(USART_GetFlagStatus(USART1, USART_FLAG_BUSY)){
		//			while(1);
		//			preset_pre_time = 7;

		//		}
		//		static int data =  0;
		//		static int lastdata = 0;
		//		data = USART_ReceiveData(USART1);
		//		if(data != lastdata){
		//			lastdata = data;
		//		}
		//		int delay_counter = 0;
		//		IWDG_ReloadCounter();
		//		for (delay_counter = 0; delay_counter<500; delay_counter++);

		// read external input
		if ((state < state_enter_service) && ((flash_counter>>4)&1)){
			if (controller_address == 15){
				external_read = (external_read << 1) | 	(!!(GPIOA->IDR & GPIO_IDR_10));
				if(!main_time && (!external_read)){
					if(curr_status != STATUS_COOLING){
						main_time = -1;
						cool_time = preset_cool_time;
						Gv_miliseconds = 0;
						flash_mode = 0;
						state = state_set_time;
						update_status();
					}
				}
				if(main_time && !~external_read){
					main_time = 0;
					Gv_miliseconds = 0;
					update_status();
				}
			}
		}
		ProcessButtons();
		switch (state){
		case state_show_time:
		case state_set_time:
			if(!pre_time && ! main_time && !cool_time ){
				flash_mode = 0;
				state = state_set_time;
				display_data = ToBCD(time_to_set);
				//				display_data = ToBCD(last_button); //Debug
			} else {
				state = state_show_time;
				//				  time_to_set = 0;
				display_data = ToBCD(abs(main_time));
				//				display_data = ToBCD(last_button); //Debug
			}
			break;
		case state_show_hours:

			if( flash_mode != 3){
				flash_mode = 3; // All flashing
			}
			{
				int index = ((flash_counter/0x200)+3) %4;
				if(index<3 ){
					display_data =  ToBCD(work_hours[index]);
				}
				else {
					display_data = 0xFFF;
				}
			}
			break;
		case state_enter_service:
			display_data = service_mode|0xF0;
			flash_mode = 0;
			break;

		case state_clear_hours:
//			flash_mode = 3;
			if((flash_counter/0x400)&1){
				display_data = 0xFFC;
			} else {
				display_data = 0xFFF;
			}
			break;
		case state_address:
			flash_mode = 0;
			if((flash_counter/0x400)&1){
				if(controller_address !=15){ // Address 15 reserved for external control
					display_data = controller_address;
				}
				else {
					display_data = 0xEAF;
				}
			} else {
				display_data = 0xFFA;
			}
			break;
		case state_pre_time:
//			flash_mode = 3;
			if((flash_counter/0x400)&1){
				display_data =  preset_pre_time;
			} else {
				display_data = 0xFF3;
			}
			break;
		case state_cool_time:
//			flash_mode = 3;
			if((flash_counter/0x400)&1){
				display_data =  preset_cool_time;
			} else {
				display_data = 0xFF4;
			}
			break;
		case state_ext_mode:
			flash_mode = 0;
			display_data = 0xFF5;
			break;

		case state_volume_1:
			flash_mode = 0;
			if((flash_counter/0x400)&1){
				display_data =  volume_message;
			} else {
				display_data = 0xFF6;
			}
			break;

		case state_volume_2:
			flash_mode = 0;
			if((flash_counter/0x400)&1){
				display_data =  temperature_threshold;
			} else {
				display_data = 0xFF7;
			}
			break;
		}
		//		show_digit(display_data);
		if (state == state_show_time){
			if(!(pre_time || main_time || cool_time)){
				// Some Paranoia...
				// turn off all
				set_lamps(0);
				set_colarium_lamps(0);
				percent_fan1 = 0;
				set_fan1(0);
				set_fan2(0);
				set_aquafresh(0);

//				state = state_set_time;
			}
		}
		//
		//		while (USART_GetFlagStatus(USART1, USART_FLAG_RXNE) == RESET); // wAIT UNTIL RX BUFFER IS EMPTY
		//		int data =  USART_ReceiveData(USART1);
		//		USART_SendData(USART1,0x80);
		//				while (USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET); // wAIT UNTIL TX BUFFER IS EMPTY
		if(++led_counter>130L){
			static int current_button_read = 0;
			static int button_buffer[16];
			static int read_counter = 0;
//			if(flash_counter%80 == 0){
//						data = (STATUS_COOLING<<6)|4;
//						USART_SendData(USART1,data);
//			}
			led_counter = 0;
			digit_num++;

			//		aqua_fresh_level = 0;
			if(digit_num>4L) {
				digit_num = 0;
				int i;
				button_buffer[read_counter] = current_button_read;
				if(read_counter++ == 15){
					read_counter = 0;
					last_button = button_buffer[0];
					for (i = 1; i<8; i++){
						last_button = last_button & button_buffer[i];
					}
				}
				current_button_read = 0;
			}
			display_data = ToBCD(dac_current_block*10 + result);
			GPIOA->BSRR = GPIO_BSRR_BR_0 | GPIO_BSRR_BR_2 ; // Turn off the lights while changing them
			GPIOB->BSRR = 0;
			GPIOC->BSRR = GPIO_BSRR_BR_0 | GPIO_BSRR_BR_13 ;
			GPIOF->BSRR = GPIO_BSRR_BR_1 ;
			if(digit_num<3){
				show_digit(((display_data & 0xFFF)& (0x0F<<(digit_num*4)))>>(digit_num*4));
//				show_digit(last_button>>(digit_num*4));
			} else {
				//show_digit(0x8);// DEBUG

			}
			{
				switch (digit_num){
				case 0:

					//set Aqua 2 LED
					if(aqua_fresh_level>0){
						GPIOA->BSRR = GPIO_BSRR_BS_8 | GPIO_BSRR_BS_11 | GPIO_BSRR_BS_12;
						GPIOC->BSRR = GPIO_BSRR_BS_10 ;
					}
					GPIOA->BSRR = GPIO_BSRR_BS_2 ;
					current_button_read |= ((!!(GPIOC->IDR & GPIO_IDR_11)) | ((!!(GPIOC->IDR & GPIO_IDR_12))<<1) | \
																		((!!(GPIOD->IDR & GPIO_IDR_2))<<2))<<0;
					break;
				case 1:

					//set Aqua 2 LEDs
					if(aqua_fresh_level>1){
						GPIOA->BSRR = GPIO_BSRR_BS_8 | GPIO_BSRR_BS_11 | GPIO_BSRR_BS_12;
						GPIOC->BSRR = GPIO_BSRR_BS_10 ;
					}
					GPIOC->BSRR = GPIO_BSRR_BS_0 ;
					current_button_read |= ((!!(GPIOC->IDR & GPIO_IDR_11)) | ((!!(GPIOC->IDR & GPIO_IDR_12))<<1) | \
																	((!!(GPIOD->IDR & GPIO_IDR_2))<<2))<<4;
					break;
				case 2:

					//set Aqua 1 LEDs
					if(aqua_fresh_level>1){
						GPIOA->BSRR = GPIO_BSRR_BS_11 | GPIO_BSRR_BS_12;
					}
					GPIOA->BSRR = GPIO_BSRR_BS_0 ;
					current_button_read |= ((!!(GPIOC->IDR & GPIO_IDR_11)) | ((!!(GPIOC->IDR & GPIO_IDR_12))<<1) | \
																	((!!(GPIOD->IDR & GPIO_IDR_2))<<2))<<8;
					break;
				case 3:

