dimitarm1/stm_flash_prj/STM32F0_Discovery_IO_Toggle/src/main.c
//	TIM6->CR1 |= TIM_CR1_CEN;

}

void I2C_MCP_send_byte(I2C_TypeDef* I2Cx, char data)
{
	int address = 0x2F; // MCP4018's fixed address
	int length = 1;
	uint32_t val = (address<<0)|(length<<16)| I2C_CR2_AUTOEND ;    //address SLAVE 7bits
	while ((I2Cx->ISR & I2C_ISR_TXE)==0);    //while TXE ==0, buffer is full
	I2Cx->CR2&= ~val;
	I2Cx->CR2|= val;
	I2Cx->CR2 &=~ I2C_CR2_RD_WRN;                        //write
	I2Cx->CR2 |= I2C_CR2_START;
	while ((I2Cx->ISR & I2C_ISR_TXE)==0);    //while TXE ==0, buffer is full
	I2Cx->TXDR=data;//example data
}

void set_pot_level(int channel, char level){
	switch(channel){
	case 1:
		i2c_config_1();
		I2C_MCP_send_byte(I2C1, level);
	case 2:
		i2c_config_1();
		I2C_MCP_send_byte(I2C2, level);
		break;
	case 3:
		i2c_config_2();
		I2C_MCP_send_byte(I2C1, level);
	case 4:
		i2c_config_2();
		I2C_MCP_send_byte(I2C2, level);
		break;
	default:
		break;

	}
}

void TIM14_IRQHandler() {
	if(!(TIM14->SR & TIM_SR_UIF) != 0) return;
	// If update flag is set

		static int dummy = 0;
		if (dummy++<10) goto finish_TIM14_isr;
		dummy = 0;//

		if(dac_fade_in_counter){
			dac_fade_in_counter--;
			if(!(dac_fade_in_counter%100)){
				set_volume(dac_fade_in_counter/10);
			}
			if(!dac_fade_in_counter){
				GPIOC->BSRR =  GPIO_BSRR_BS_3; // Internal sound
			}
			goto finish_TIM14_isr;
		}

		if(dac_fade_out_counter){
			GPIOC->BRR =  GPIO_BRR_BR_3; // External sound

			dac_fade_out_counter--;
			if(!(dac_fade_out_counter%100)){
				set_volume(10 - dac_fade_out_counter/10);
			}
			if(dac_fade_out_counter<=0){
				TIM_Cmd(TIM14, DISABLE);
			}
			goto finish_TIM14_isr;
		}
		unsigned char vol = 10; //10-volume_message%10;
		TIM_SetCompare1(TIM14, dac_buffer[dac_ping_pong_state][dac_out_counter]/vol);

		if(dac_out_counter<1024){
			dac_out_counter++;
		} else {
			if (dac_current_block >= message_sector_counts[dac_current_message]){
					dac_fade_out_counter = 100;
					dac_current_message = -1;
			}
			dac_out_counter = 0;
			dac_ping_pong_state = !dac_ping_pong_state;
		}

	finish_TIM14_isr:
	TIM14->SR &= ~TIM_SR_UIF; // Interrupt has been handled }
}




/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
